<?
 /**********************************************************************************/
	//기간동안의 전체 건수를 나누어서
	///페이지 마다 20개의 Data 만 불러 온다                                            //
	 /**********************************************************************************/
	// echo "page $page";
	if(!$pages){//처음에는 페이지가 없다
		$pages=1;
	}
	//echo "page $page";
	$max_num =14;
	$count = $max_num * $pages - 14;
	if($total<14){
		$last=$total;
	}else{
		$last=14;
	}
	if($total-$count<14){//총개수-$congt 32-14인경우에만
		$last=$total-$count;
	}
	$last=$count+$last;
 /**********************************************************************************/


?>